app/controllers/reviews_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @movie = Movie.find(params[:movie_id])

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    @movie = Movie.find(params[:movie_id])

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "Cool"], ["created_at", "2016-01-07 05:24:28.910673"], ["movie_id", 1], ["name", "Steve"], ["stars", 3], ["updated_at", "2016-01-07 05:24:28.910673"]]
---
  def create
    @movie = Movie.find(params[:movie_id])
    @review = @movie.reviews.new(review_params)
    if @review.save